---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralConnectionSettings
source: html/e70eb9af-6795-63d0-417f-40806ee73f8f.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionSettings

Provides access to project-wide structural connections settings.

## Syntax (C#)
```csharp
public class StructuralConnectionSettings : Element
```